#ifndef _CPP_TOOLBOX_H_
#define _CPP_TOOLBOX_H_

#include <algorithm>
#include <array>
#include <atomic>
#include <cctype>
#include <cmath>
#include <condition_variable>
#include <cstdint>
#include <cstdio>
#include <cstdlib>
#include <filesystem>
#include <fstream>
#include <functional>
#include <future>
#include <iostream>
#include <iterator>
#include <locale>
#include <memory>
#include <mutex>
#include <queue>
#include <regex>
#include <sstream>
#include <string>
#include <thread>
#include <type_traits>
#include <unordered_map>
#include <vector>

#ifdef _WIN32
#define FUNCTION __FUNCSIG__
#else
#define FUNCTION __PRETTY_FUNCTION__
#endif

#if __GNUC__ >= 3
#define NORETURN __attribute__((noreturn))
#define likely(x) __builtin_expect((x), 1)
#define unlikely(x) __builtin_expect((x), 0)
#else
#define NORETURN /* nothing */
#define likely(x) (x)
#define unlikely(x) (x)
#endif

#define CACHELINE_SIZE 64

#define UNUSED(x) (void)(x)
#define UNUSED_RETURN(x) (void)(x)
#define UNUSED_RETURN_VOID(x) (void)(x)
#define UNUSED_VOID(x) (void)(x)
#define UNUSED_VOID_RETURN(x) (void)(x)
#define UNUSED_VOID_RETURN_VOID(x) (void)(x)

#define ARRAY_SIZE(x) (sizeof(x) / sizeof(x[0]))

#define DEFINE_TYPE_TRAIT(name, func)                                          \
  template <typename T> struct name {                                          \
    template <typename Class>                                                  \
    static constexpr bool Test(decltype(&Class::func) *) {                     \
      return true;                                                             \
    }                                                                          \
    template <typename> static constexpr bool Test(...) { return false; }      \
                                                                               \
    static constexpr bool value = Test<T>(nullptr);                            \
  };                                                                           \
                                                                               \
  template <typename T> constexpr bool name<T>::value;

// log macros
#define LOG_ERROR(...)                                                         \
  cpp_toolbox::logger::Logger::GetInstance().VError(                           \
      __FILE__, __LINE__, static_cast<const char *>(FUNCTION), __VA_ARGS__)
#define LOG_WARNING(...)                                                       \
  cpp_toolbox::logger::Logger::GetInstance().VWarning(                         \
      __FILE__, __LINE__, static_cast<const char *>(FUNCTION), __VA_ARGS__)

#define LOG_INFO(...)                                                          \
  cpp_toolbox::logger::Logger::GetInstance().VInfo(                            \
      __FILE__, __LINE__, static_cast<const char *>(FUNCTION), __VA_ARGS__)
#define LOG_DEBUG(...)                                                         \
  cpp_toolbox::logger::Logger::GetInstance().VDebug(                           \
      __FILE__, __LINE__, static_cast<const char *>(FUNCTION), __VA_ARGS__)

// type short
using i8 = int8_t;
using i16 = int16_t;
using i32 = int32_t;
using i64 = int64_t;
using u8 = uint8_t;
using u16 = uint16_t;
using u32 = uint32_t;
using u64 = uint64_t;
using f32 = float;
using f64 = double;

static_assert(sizeof(i8) == 1, "size of i8 is 1 byte");
static_assert(sizeof(i16) == 2, "size of i16 is 2 bytes");
static_assert(sizeof(i32) == 4, "size of i32 is 4 bytes");
static_assert(sizeof(i64) == 8, "size of i64 is 8 bytes");
static_assert(sizeof(u8) == 1, "size of u8 is 1 byte");
static_assert(sizeof(u16) == 2, "size of u16 is 2 bytes");
static_assert(sizeof(u32) == 4, "size of u32 is 4 bytes");
static_assert(sizeof(u64) == 8, "size of u64 is 8 bytes");
static_assert(sizeof(f32) == 4, "size of f32 is 4 bytes");
static_assert(sizeof(f64) == 8, "size of f64 is 8 bytes");

using ai8 = std::atomic<i8>;
using ai16 = std::atomic<i16>;
using ai32 = std::atomic<i32>;
using ai64 = std::atomic<i64>;
using au8 = std::atomic<u8>;
using au16 = std::atomic<u16>;
using au32 = std::atomic<u32>;
using au64 = std::atomic<u64>;
using abool = std::atomic<bool>;

namespace cpp_toolbox {

namespace compile {
template <typename T> struct is_const { static constexpr bool value = false; };

template <typename T> struct is_const<const T> {
  static constexpr bool value = true;
};

template <typename T> constexpr bool is_const_v = is_const<T>::value;
template <typename T> struct is_volatile {
  static constexpr bool value = false;
};

template <typename T> struct is_volatile<volatile T> {
  static constexpr bool value = true;
};
template <typename T> constexpr bool is_volatile_v = is_volatile<T>::value;

template <typename T> struct is_const_volatile {
  static constexpr bool value = false;
};
